Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་གྱི་ཡན་ལག་དང་།
en: An avagama times an avagama is a vigava.

source: ཉིང་ལག་གི་མཚན་གྱི་རྒྱུད་དང་། རྒྱུས་དང་།
en: A vigava times a vigava is a saṃkrama.

source: རྣམ་པར་དཔྱད་པ་ཤེས་པར་བྱ་བ་དང་། བདེ་འགྲོ་དང་ངན་སོང་གི་ལས་ཀྱི་ལམ་རྣམ་པར་དག་པར་བྱ་བའི་ཚུལ་ཤེས་པར་བྱ་བ་དང་།
en: A saṃkrama times a saṃkrama is a visara.

source: དགེ་བ་དང་མི་དགེ་བའི་ཆོས་དང་།
en: A visara times a visara is a vibhaja.

source: ཚོགས་མཆོད་པ་ཤེས་པར་བྱ་བ་དང་།
en: A vibhaja times a vibhaja is a vijaṅgha.

source: བདེ་འགྲོ་དང་ངན་སོང་གི་ཚོགས་ཤེས་པར་བྱ་བ་དང་། ཉན་ཐོས་དང་།
en: A vijaṅgha times a vijaṅgha is a visota.

source: རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་ཚོགས་ཤེས་པར་བྱ་བ་དང་།
en: A visota times a visota is a vivāha.

source: དེ་བཞིན་གཤེགས་པའི་སའི་ཚོགས་ཤེས་པར་བྱ་བ་དང་།
en: A vivāha times a vivāha is a vibhakta.

source: རྒྱུ་དང་བྱེད་པ་དང་།
en: A vibhakta times a vibhakta is a vikhata.

source: སྦྱོར་བའི་རྒྱུད་ཤེས་པར་བྱ་བ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཤེས་ཏེ།
en: A vikhata times a vikhata is a tulana.

source: དེ་དག་ལ་སེམས་ཅན་ཡོངས་སུ་གཟུད་པ་བྱེད་དོ། །
en: A tulana times a tulana is an atula.

source: རབ་ཏུ་དགོད་པ་བྱེད་དོ། །
en: An atula times an atula is a varaṇa.

source: ཡོངས་སུ་གཞོག་པ་བྱེད་དོ། །སློབ་ཏུ་འཛུད་དོ། །
en: A varaṇa times a varaṇa is a vivaraṇa.

source: སྦྱོང་དུ་འཛུད་དོ། །བརྟན་པར་བྱེད་དོ། །
en: A vivaraṇa times a vivaraṇa is an avana.

source: ལྷུར་ལེན་པར་བྱེད་དོ། །
en: An avana times an avana is a thavana.

source: རྫོགས་པར་བྱེད་དོ། །
en: A thavana times a thavana is a viparya.

source: ཡོངས་སུ་སྒྲུབ་པར་བྱེད་དོ། །
en: A viparya times a viparya is a samarya.

source: ཡོངས་སུ་སྤྱོད་པར་བྱེད་དོ། །གསལ་བར་བསྟན་པར་བྱེད་དོ། །
en: A samarya times a samarya is a viturṇa.

source: རྣམ་པར་འཕེལ་བར་བྱེད་དོ། །མཚན་མར་བྱེད་དོ། །
en: A viturṇa times a viturṇa is an hetura.

source: མཐར་ཕྱིན་པར་བྱེད་དོ། །
en: A hetura times a hetura is a vicāra.

source: རྣམ་པར་སྦྱོང་བར་བྱེད་དོ། །
en: A vicāra times a vicāra is a visāra.

source: དྲི་མ་མེད་པར་བྱེད་དོ། །
en: A visāra times a visāra is a vyatyasta.

source: ཤིན་ཏུ་དག་པར་བྱེད་དོ། །
en: A vyatyasta times a vyatyasta is an abhyudgata.

source: འོད་གསལ་ཞིང་དང་བར་བྱེད་དོ། །
en: An abhyudgata times an abhyudgata is a viśiṣṭa.

source: ཤིན་ཏུ་ཡངས་པར་བྱེད་དོ། །དེ་ལྟར་རིགས་ཀྱི་བུ་ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྩིས་ཀྱི་ཚུལ་ཤེས་པ་དེ་གང་ཞེ་ན། །
en: A viśiṣṭa times a viśiṣṭa is a nivala.

source: བརྒྱ་སྟོང་ཕྲག་བརྒྱ་ན་བྱེ་བའོ། །
en: A nivala times a nivala is a haribha.

source: བྱེ་བ་བྱེ་བ་ན་ཁོད་ཁོད་དོ། །
en: A haribha times a haribha is a vikṣobha.

source: ཁོད་ཁོད་ཁོད་ཁོད་ན་ཐ་དགུའོ། །
en: A vikṣobha times a vikṣobha is a halibha.

source: ཐ་དགུ་ཐ་དགུ་ན་ཁྲིག་ཁྲིག་གོ །
en: A halibha times a halibha is a harisa.

source: ཁྲིག་ཁྲིག་ཁྲིག་ཁྲིག་ན་ཐམས་ཐམས་སོ། །ཐམས་ཐམས་ཐམས་ཐམས་ན་མྱང་མྱིད་དོ། །མྱད་མྱིད་མྱད་མྱིད་ན་གང་ཡའོ། །
en: A harisa times a harisa is an aloka.

source: གང་ཡ་གང་ཡ་ན་བན་བུན་ནོ། །
en: An aloka times an aloka is a dṛṣṭānta.

source: བན་བུན་བན་བུན་ན་ཕྱར་ཕྱུར་རོ། །
en: A dṛṣṭānta times a dṛṣṭānta is a hetuna.

source: ཕྱར་ཕྱུར་ཕྱར་ཕྱུར་ན་ལྕག་ལྕིག་གོ །
en: A hetuna times a hetuna is a durbuda.

source: ལྕག་ལྕིག་ལྕག་ལྕིག་ན་བྱང་བྱིང་ངོ་། །
en: A durbuda times a durbuda is a haruṇa.

source: བྱང་བྱིང་བྱང་བྱིང་ན་ཆེམ་ཆེམ་མོ། །
en: A haruṇa times a haruṇa is an ela.

source: ཆེམ་ཆེམ་ཆེམ་ཆེམ་ན་ཕྱལ་ཕྱོལ་ལོ། །
en: An ela times an ela is a dumela.

source: ཕྱལ་ཕྱོལ་ཕྱལ་ཕྱོལ་ན་ཁྱུད་ཁྱུད་དོ། །ཁྱུད་ཁྱུད་ཁྱུད་ཁྱུད་ན་ཟར་ཟེར་རོ། །
en: A dumela times a dumela is a kṣemu.

source: ཟར་ཟེར་ཟར་ཟེར་ན་ཁྲིབ་ཁྲིབ་བོ། །
en: A kṣemu times a kṣemu is an akṣayamukta.

source: ཁྲིབ་ཁྲིབ་ཁྲིབ་ཁྲིབ་ན་ཡ་གངས་སོ། །
en: An akṣayamukta times an akṣayamukta is an elada.

source: ཡ་གངས་ཡ་གངས་ན་ཆོ་མའོ། །
en: An elada times an elada is a māluda.

source: ཆོ་མ་ཆོ་མ་ན་ཁྲམ་ཁྲིམ་མོ། །
en: A māluda times a māluda is a maṇḍumā.

source: ཁྲམ་ཁྲིམ་ཁྲམ་ཁྲིམ་ན་ནབ་ནུབ་བོ། །
en: A maṇḍumā times a maṇḍumā is a viṣamatā.

source: ནབ་ནུབ་ནབ་ནུབ་ན་སང་སང་ངོ་། །
en: A viṣamatā times a viṣamatā is a samatā.

source: སང་སང་སང་སང་ན་བརྒྱུད་ཡས་སོ། །
en: A samatā times a samatā is a visada.

source: བརྒྱུད་ཡས་བརྒྱུད་ཡས་ན་བཏང་ཡས་སོ། །
en: A visada times a visada is a pramantā.

source: བཏང་ཡས་བཏང་ཡས་ན་བཀྲ་ཡར་རོ། །
en: A pramantā times a pramantā is a pramātra.

source: བཀྲ་ཡར་བཀྲ་ཡར་ན་གསའ་ཡས་སོ། །
en: A pramātra times a pramātra is an amātra.

source: གསའ་ཡས་གསའ་ཡས་ན་མཚུངས་མེད་དོ། །
en: An amātra times an amātra is a bhramātra.

source: མཚུངས་མེད་མཚུངས་མེད་ན་ལམ་ལུམ་མོ། །
en: A bhramātra times a bhramātra is a gamātra.

source: ལམ་ལུམ་ལམ་ལུམ་ན་ཡལ་ཡོལ་ལོ། །
en: A gamātra times a gamātra is a namātra.

source: ཡལ་ཡོལ་ཡལ་ཡོལ་ན་ཁྲལ་ཁྲུལ་ལོ། །
en: A namātra times a namātra is a hemātra.

source: ཁྲལ་ཁྲུལ་ཁྲལ་ཁྲུལ་ན་ཐུད་ཐུད་དོ། །
en: A hemātra times a hemātra is a vimātra.

source: ཐུང་ཐུང་ཐུང་ཐུང་ན་བསམ་ཕྱོད་དོ། །བསམ་ཕྱོད་བསམ་ཕྱོད་ན་བྲང་བྲེང་ངོ་། །བྲང་བྲེང་བྲང་བྲེད་ན་བགྲོད་ཡས་སོ། །
en: A vimātra times a vimātra is a paramātra.

source: བགྲོད་ཡས་བགྲོད་ཡས་ན་བསྔོ་ཡས་སོ། །
en: A paramātra times a paramātra is a śivamātra.

source: བསྔོ་ཡས་བསྔོ་ཡས་ན་ཟང་ཡག་གོ །
en: A śivamātra times a śivamātra is an ela.

source: ཟང་ཡག་ཟང་ཡག་ན་འཕྲོ་བ་ཀྱེའོ། །
en: An ela times an ela is a vela.

source: འཕྲོ་བཀྱེ་འཕྲོ་བཀྱེ་ན་རྩེ་འཕྱོའོ། །
en: A vela times a vela is a tela.

source: རྩེ་འཕྱོ་རྩེ་འཕྱོ་ན་ཡོང་ཏན་ནོ། །ཡོང་ཏན་ཡོང་ཏན་ན་བྲུག་གཡོས་སོ། །བྲུག་གཡོས་བྲུག་གཡོས་ན་སང་ཡལ་ལོ། །
en: A tela times a tela is a śaila.A śaila times a śaila is a gela.

source: སང་ཡལ་སང་ཡལ་ན་འཐིང་ཡུག་གོ །
en: A gela times a gela is a śila.

source: འཐིང་ཡུག་འཐིང་ཡུག་ན་ཡིད་འཕྱོའོ། །
en: A śila times a śila is a śvela.

source: ཡིད་འཕྱོ་ཡིད་འཕྱོ་ན་ནབ་ནེབ་བོ། །ནབ་ནེབ་ནབ་ནེབ་ན་ཁྲིག་ཐམས་སོ། །
en: A śvela times a śvela is a nela.

source: ཁྲིག་ཐམས་ཁྲིག་ཐམས་ན་ཡལ་ཡལ་ལོ། །
en: A nela times a nela is a bhela.

source: ཡལ་ཡལ་ཡལ་ཡལ་ན་བགྲད་ཡས་སོ། །བགྲང་ཡས་བགྲང་ཡས་ན་ཐུག་ཡལ་ལོ། །
en: A bhela times a bhela is a kela .

source: ཐུག་ཡལ་ཐུག་ཡལ་ན་ཤང་ཤང་ངོ་། །
en: A kela times a kela is a sela.

source: ཤང་ཤང་ཤང་ཤང་ན་ཡག་ཡག་གོ །
en: A sela times a sela is a pela.

source: ཡག་ཡག་ཡག་ཡག་ན་ཐམ་ཐིམ་མོ། །
en: A pela times a pela is a hela.

source: ཐམ་ཐིམ་ཐམ་ཐིམ་ན་རློམ་བསྙལ་ལོ། །
en: A hela times a hela is a mela.

source: རློམ་བསྙལ་རློམ་བསྙལ་ན་གཞལ་འཕྱོས་སོ། །
en: A mela times a mela is a saraḍa.

source: གཞལ་འཕྱོས་གཞལ་འཕྱོས་ན་གཞལ་ཡལ་ལོ། །
en: A saraḍa times a saraḍa is a māruta.

source: གཞལ་ཡལ་གཞལ་ཡལ་ན་གཞལ་མེད་དོ། །
en: A māruta times a māruta is a meruda.

source: གཞལ་མེད་གཞལ་མེད་ན་གཞལ་འཁོར་ཏོ། །
en: A meruda times a meruda is a kheluda.

source: གཞལ་འཁོར་གཞལ་འཁོར་ན་གཞལ་ཐིམ་མོ། །
en: A kheluda times a kheluda is a māluda.

source: གཞལ་ཐིམ་གཞལ་ཐིམ་ན་གར་གཞལ་ལོ། །
en: A māluda times a māluda is a samula.

source: གར་གཞལ་གར་གཞལ་ན་གཞལ་སངས་སོ། །
en: A samula times a samula is an ayava.

source: གཞལ་སངས་གཞལ་སངས་ན་གཞལ་ཐག་གོ །
en: An ayava times an ayava is a kamala.

source: གཞལ་ཐག་གཞལ་ཐག་ན་གཞལ་ཕུལ་ལོ། །
en: A kamala times a kamala is a magava.

source: གཞལ་ཕུལ་གཞལ་ཕུལ་ན་གཞལ་ཞིའོ། །
en: A magava times a magava is an atara.

source: གཞལ་ཞི་གཞལ་ཞི་ན་འཕྱོ་འགྱུར་རོ། །
en: An atara times an atara is a heluya.

source: འཕྱོ་འགྱུར་འཕྱོ་འགྱུར་ན་ཉར་ཉེར་རོ། །ཉར་ཉེར་ཉར་ཉེར་ན་ཕྱག་ཕྱིག་གོ །
en: A heluya times a heluya is a veluva.

source: ཕྱག་ཕྱིག་ཕྱག་ཕྱིག་ན་ཟལ་ཟུལ་ལོ། །
en: A veluva times a veluva is a kajāva.

source: ཟལ་ཟུལ་ཟལ་ཟུལ་ན་སལ་སལ་ལོ། །
en: A kajāva times a kajāva is a havava.

source: སལ་སལ་སལ་སལ་ན་གཡོ་ལྡེག་གོ །
en: A havava times a havava is a havala.

source: གཡོ་ལྡེག་གཡོ་ལྡེག་ན་ཕན་ཕུན་ནོ། །ཕན་ཕུན་ཕན་ཕུན་ན་བརྣང་ཡའོ། །
en: A havala times a havala is a vivara.

source: བརྣང་ཡ་བརྣང་ཡ་ན་རེམ་འདྲོལ་ལོ། །
en: A vivara times a vivara is a bimba.

source: རེམ་འདྲོལ་རེམ་འདྲོལ་ན་རྫི་ངད་དོ། །རྫི་ངད་རྫི་ངད་ན་རྫི་རྡུལ་ལོ། །
en: A bimba times a bimba is a caraṇa.

source: རྫི་རྡུལ་རྫི་རྡུལ་ན་ཕུན་ཡོལ་ལོ། །ཕུན་ཡོལ་ཕུན་ཡོལ་ན་ངད་ངད་དོ། །
en: A caraṇa times a caraṇa is a carama.

source: ངད་ངད་ངད་ངད་ན་བགྲང་བརྩིའོ། །
en: A carama times a carama is a parava.

source: བགྲང་བརྩི་བགྲང་བརྩི་ན་ཟབ་བགྲང་ངོ་། །
en: A parava times a parava is a dhavara.

source: ཟབ་བགྲང་ཟབ་བགྲང་ན་དགའ་རྐྱང་ངོ་། །
en: A dhavara times a dhavara is a dhamana.

source: དགའ་རྐྱང་དགའ་རྐྱང་ན་གཞུང་འདལ་ཏོ། །གཞུང་འདལ་གཞུང་འདལ་ན་ཁྲུག་ཕྱད་དོ། །
en: A dhamana times a dhamana is a pramada.

source: ཁྲུག་ཕྱད་ཁྲུག་ཕྱད་ན་འོལ་ཕྱོད་དོ། །འོལ་ཕྱོད་འོལ་ཕྱོད་ན་གདབ་ཡས་སོ། །
en: A pramada times a pramada is a nigama.

source: གདབ་ཡས་གདབ་ཡས་ན་གཅལ་ཡས་སོ། །
en: A nigama times a nigama is an upavarta.

source: གཅལ་ཡས་གཅལ་ཡས་ན་བགྲང་ཡས་སོ། །
en: An upavarta times an upavarta is a nirdeśa.

source: བགྲང་ཡས་བགྲང་ཡས་ན་བྱིམ་འཕྱོའོ། །
en: A nirdeśa times a nirdeśa is an akṣaya.

source: བྱིམ་འཕྱོ་བྱིམ་འཕྱོ་ན་ཡམ་མེའོ། །
en: An akṣaya times an akṣaya is a saṃbhūta.

source: ཡམ་མེ་ཡམ་མེ་ན་བསྙལ་ཡས་སོ། །
en: A saṃbhūta times a saṃbhūta is an amama.

source: བསྙལ་ཡས་བསྙལ་ཡས་ན་ལྡབ་ལྡེབ་བོ། །
en: An amama times an amama is an avada.

source: ལྡབ་ལྡེབ་ལྡབ་ལྡེབ་ན་འཕན་ཆད་དོ། །
en: An avada times an avada is an utpala.

source: འཕན་ཆད་འཕན་ཆད་ན་ཕང་ཕུང་ངོ་། །
en: An utpala times an utpala is a padma.

source: ཕང་ཕུང་ཕང་ཕུང་ན་ཁེའུ་ཚང་ངོ་། །
en: A padma times a padma is a saṃkhya.

source: ཁེའུ་ཚང་ཁེའུ་ཚང་ན་ཞུང་ཟུང་ངོ་། །ཞུང་ཟུང་ཞུང་ཟུང་ན་མཆོག་ཡལ་ལོ། །
en: A saṃkhya times a saṃkhya is a gati.

source: མཆོག་ཡལ་མཆོག་ཡལ་ན་མཐའ་རྟུལ་ཏོ། །
en: A gati times a gati is an upagama.

source: མཐའ་རྟུལ་མཐའ་རྟུལ་ན་ཡུན་འགྱངས་སོ། །ཡུན་འགྱངས་ཡུན་འགྱངས་ན་བུན་ལོབ་བོ། །
en: An upagama times an upagama is an aupamya.

source: བུན་ལོབ་བུན་ལོབ་ན་ལམ་ལོམ་མོ། །ལམ་ལོམ་ལམ་ལོམ་ན་བསྙད་ཡས་སོ། །
en: An aupamya times an aupamya is an asaṃkhyeya.

source: བསྙད་ཡས་བསྙད་ཡས་ན་ལང་ལིང་ངོ་། །ལང་ལིང་ལང་ལིང་ན་ལྗབ་ལྗིབ་བོ། །
en: An asaṃkhyeya times an asaṃkhyeya is an asaṃkhyeya­parivarta.

source: ལྗབ་ལྗེབ་ལྗབ་ལྗིབ་ན་མྱི་བརྩལ་ཏོ། །མྱི་བརྩལ་མྱི་བརྩལ་ན་འབྱམ་ཡས་སོ། །འབྱམ་ཡས་འབྱམ་ཡས་ན་ང་འགྲང་ངོ་།
en: An asaṃkhyeya­parivarta times an asaṃkhyeya­parivarta is an aparimāṇa.

source: ང་འགྲང་ང་འགྲང་ན་སྨོས་ཡལ་ལོ། །སྨོས་ཡལ་སྨོས་ཡལ་ན་བཀྲ་ཆལ་ལོ། །
en: An aparimāṇa times an aparimāṇa is an aparimāṇa­parivarta.

source: བཀྲ་ཆལ་བཀྲ་ཆལ་ན་ལོ་རྒྱས་སོ། །
en: An aparimāṇa­parivarta times an aparimāṇa­parivarta is an aparyanta.

source: ལོ་རྒྱས་ལོ་རྒྱས་ན་འབུམ་རྡིབ་བོ། །
en: An aparyanta times an aparyanta is an aparyanta­parivarta.

source: འབུམ་རྡིབ་འབུམ་རྡིབ་ན་གང་གུམ་མོ། །གང་གུམ་གང་གུམ་ན་ལ་ལོའོ། །
en: An aparyanta­parivarta times an aparyanta­parivarta is an asamanta.

source: ལ་ལོ་ལ་ལོ་ན་བགྲང་འཕྱོས་སོ། །བགྲང་འཕྱོས་བགྲང་འཕྱོས་ན་བགྲོང་འཕྱོས་ལ་བསྒྲེས་བའོ། །བགྲང་འཕྱོས་ལ་བསྒྲེས་པ་བགྲང་འཕྱོས་ལ་བསྒྲེས་ན་དཔག་ཡས་སོ། །དཔག་ཡས་དཔག་ཡས་ན་དཔག་ཡས་ལ་བསྒྲེས་པའོ། །
en: An asamanta times an asamanta is an asamanta­parivarta.

source: དཔག་ཡས་ལ་བསྒྲེས་པ་དཔག་ཡས་ལ་བསྒྲེས་ན་ཡལ་ཕྱོད་དོ། །
en: An asamanta­parivarta times an asamanta­parivarta is an agaṇeya.

source: ཡལ་ཕྱོད་ཡལ་ཕྱོད་ན་ཡལ་ཕྱོད་ལ་བསྒྲེས་པའོ། །
en: An agaṇeya times an agaṇeya is an agaṇeya­parivarta.

source: ཡལ་ཕྱོད་ལ་བསྒྲེས་པ་ཡལ་ཕྱོད་ལ་བསྒྲེས་ན་མུ་ཡལ་ཏོ། །
en: An agaṇeya­parivarta times an agaṇeya­parivarta is an atulya.

source: མུ་ཡལ་མུ་ཡལ་ན་མུ་ཡལ་ལ་བསྒྲེས་པའོ། །མུ་ཡལ་ལ་བསྒྲེས་བ་མུ་ཡལ་ལ་བསྒྲེས་པ་ན་བགྲང་ཡོལ་ལོ། །
en: An atulya times an atulya is an atulya­parivarta.An atulya­parivarta times an atulya­parivarta is an acintya.

source: བགྲང་ཡོལ་བགྲང་ཡོལ་ན་བགྲང་ཡོལ་ལ་བསྒྲེས་པའོ། །
en: An acintya times an acintya is an acintya­parivarta.

source: བགྲང་ཡོལ་ལ་བསྒྲེས་པ་བགྲང་ཡོལ་ལ་བསྒྲེས་ན་མྱི་མཇལ་ཏོ། །
en: An acintya­parivarta times an acintya­parivarta is an aparyanta.

source: མྱི་མཇལ་མྱི་མཇལ་ན་མི་མཇལ་ལ་བསྒྲེས་པའོ། །
en: An aparyanta times an aparyanta is an aparyanta­parivarta.

source: མི་མཇལ་ལ་བསྒྲེས་བ་མྱི་མཇལ་ལ་བསྒྲེས་ན་བསམ་ཕྱོད་དོ། །བསམ་ཕྱོད་བསམ་ཕྱོད་ན་བསམ་ཕྱོད་ལ་བསྒྲེས་པའོ། །
en: An aparyanta­parivarta times an aparyanta­parivarta is an amāpya.

source: བསམ་ཕྱོད་ལ་བསྒྲེས་པ་བསམ་ཕྱོད་ལ་བསྒྲེས་ན་མཐའ་འབྱམ་མོ། །མཐའ་འབྱམ་མཐའ་འབྱམ་ན་དཔག་ཐག་གོ། །
en: An amāpya times an amāpya is an amāpya­parivarta.

source: དཔག་ཐག་དཔག་ཐག་ན་དཔག་ཐག་ལ་བསྒྲེས་པའོ། །
en: An amāpya­parivarta times an amāpya­parivarta is an anabhilāpya.

source: དཔག་ཐག་ལ་བསྒྲེས་པ་དཔག་ཐག་ལ་བསྒྲེས་ན་བརྗོད་དུ་མྱེད་པའོ། །
en: An anabhilāpya times an anabhilāpya is an anabhilāpya­parivarta.

source: བརྗོད་དུ་མེད་པ་བརྗོད་དུ་མྱེད་པ་ན་བརྗོད་དུ་མེད་པ་ལ་བསྒྲེས་པའོ། །
en: An anabhilāpya­parivarta times an anabhilāpya­parivarta is an anabhilāpyānabhilāpya.

source: བརྗོད་དུ་མེད་པ་ལ་བསྒྲེས་པ་བརྗོད་དུ་མེད་པ་ལ་བསྒྲེས་ན་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་ལ་བསྒྲེས་པ་ཤིན་ཏུ་བསྟན་པའོ། །
en: An anabhilāpyānabhilāpya times an anabhilāpyānabhilāpya is an anabhilāpyānabhilāpya­parivarta.”

source: དེའི་མདུན་ན་བྱེ་མའི་ཕུང་པོ་ཆེན་པོ་དཔག་ཚད་དུ་མའི་ཚད་དང་ལྡན་པ་ཞིག་འདུག་འདུག་པ་ལས། །
en: In front of Indriyeśvara there was a heap of sand that was many yojanas high.

source: འདི་ལ་བྱེ་མའི་འབྲུ་འདི་སྙེད་ཅིག་ཡོད་དོ་ཞེས་བྱ་བ་ནས། བྱེ་མའི་འབྲུ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་ལ་བསྒྲེས་པ་ལ་འདི་སྙེད་ཅིག་ཡོད་དོ་ཞེས་རབ་ཏུ་ཕྱེ་ནས་བགྲང་བརྩིས་ཏེ་གྲངས་སུ་བཅད་དོ། །
en: He counted how many grains of sand there were in that heap, beginning with “the number of grains of sand in this mound” and continuing until he said, “there are an anabhilāpyānabhilāpya­parivarta of grains of sand in this heap.”

source: དེས་བྱེ་མའི་ཕུང་པོ་དེ་བརྩིས་ཀྱི་བརྡར་བསྟན་པས། ཤིན་ཏུ་བསྟན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བགྲང་བའི་ཚུལ་འདི་ནི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཀུན་ནའང་ཡོད་དེ། །
en: Having taught Sudhana through the teaching that stipulated the number of grains of sand in that heap of sand, he said, “Noble one, this method of counting of the bodhisattvas continues from one world realm to another.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བགྲང་བའི་ཚུལ་འདིས་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་དག་ཀྱང་བགྲང་ཞིང་རྩིའོ། །དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་།
en: With this method of counting of the bodhisattvas, one can calculate the number of the entire extent of world realms in the eastern direction.

source: བྱང་ཤར་གྱི་ཕྱོགས་འཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་འཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་འཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་འཚམས་དང་། །འོག་དང་སྟེང་གི་ཕྱོགས་སུ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བགྲང་བའི་ཚུལ་འདིས་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་བ་དག་ཀྱང་བགྲང་ཞིང་རྩིའོ། །
en: In the same way, with this method of counting of the bodhisattvas, one can calculate the number of the entire extent of world realms in the southern direction, in the western direction, in the northern direction, in the northeastern direction, in the southeastern direction, in the southwestern direction, in the northwestern direction, in the upward direction, and in the downward direction.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བགྲང་བའི་ཚུལ་འདི་ནི། །ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་མྱིང་དུ་བྱ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བསྟན་དུ་ཡོད་པ་ཐམས་ཅད་ནའང་ཡོད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བགྲང་བའི་ཚུལ་འདིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་མྱིང་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བགྲང་ཞིང་རྩིའོ། །
en: “Noble one, with this method of counting of the bodhisattvas, the entire extent of the succession of the names of world realms in the ten directions are taught; with this method of counting of the bodhisattvas, the entire extent of the succession of the names of world realms in the ten directions is counted.

source: ཇི་ལྟར་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་མྱིང་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བསྟན་དུ་ཡོད་པ་དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་བསྐལ་པའི་མྱིང་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བསྟན་དུ་ཡོད་པ་དང་། སངས་རྒྱས་ཀྱི་མཚན་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བསྟན་དུ་ཡོད་པ་དང་། ཆོས་ཀྱི་མྱིང་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བསྟན་དུ་ཡོད་པ་དང་། སེམས་ཅན་གྱི་མྱིང་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བསྟན་དུ་ཡོད་པ་དང་། ལས་ཀྱི་མྱིང་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བསྟན་དུ་ཡོད་པ་ཀུན་ལའང་འཇུག་སྟེ།
en: “Just as the entire extent of the succession of world realms in the ten directions is taught, in the same way the succession of names of kalpas in the ten directions is taught, the succession of the names of buddhas is taught, the succession of the names of Dharmas is taught, the succession of the names of beings is taught, and the succession of the names of actions is taught, so that all these are comprehended.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བགྲང་བའི་ཚུལ་འདི་ཉིད་ནི། ཕྱོགས་བཅུ་ན་མྱིང་དུ་བྱ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་བསྟན་དུ་རུང་བ་ཇི་སྙེད་པ་ཐམས་ཅད་ལའང་འཇུག་སྟེ།
en: “With this method of counting of the bodhisattvas, the entirety of however many successions of names that can be taught and that are in the ten directions is comprehended in full.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བགྲད་བའི་ཚུལ་འདིས་ཕྱོགས་བཅུ་ན་མྱིང་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཇི་སྙེད་ཡོད་པ་ཐམས་ཅད་ཀྱང་བགྲང་ཞིང་རྩིའོ། །
en: “With this method of counting of the bodhisattvas, the entirety of however many successions of names that can be taught and that are in the ten directions is counted in full.

source: དེ་ལྟར་རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་སྣང་བ་ཆོས་ཐམས་ཅད་ཤེས་པར་བྱ་བའི་བཟོ་མངོན་པར་ཤེས་པ་དང་ལྡན་པ་འདི་ཤེས་བར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་གྲངས་ལ་ཞུགས་པ། ཆོས་ཀྱི་ཚུལ་ཐམས་ཅད་ཀྱི་གྲངས་ལ་ཞུགས་པ། དུས་གསུམ་གྱི་གྲངས་ལ་ཞུགས་པ།
en: “However, noble one, in that way I know only this light of bodhisattva wisdom that is the possession of the clairvoyance of crafts that is the knowledge of all phenomena.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་གྲངས་ལ་ཞུགས་པ། ཆོས་ཀྱི་ཕུང་པོ་ཐམས་ཅད་ཀྱི་གྲངས་ལ་ཞུགས་པ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་གྲངས་ལ་ཞུགས་པ། །ཆོས་ཐམས་ཅད་ཀྱི་མིང་གི་འཁོར་ལོ་ལ་དབང་བསྒྱུར་བ་དེ་དག་གི་སྤྱོད་པ་ཤེས་བའམ།
en: How could I know the conduct of the bodhisattvas who engage with the number of all beings, who engage with the number of all the accumulations of Dharmas, who engage with the number of all the buddhas and bodhisattvas, and who have power over the wheel of the names of all the Dharmas?

source: ཡོན་ཏན་བརྗོད་པའམ།
en: How could I describe their qualities?

source: སྤྱོད་ཡུལ་སྨོས་པའམ། །
en: How could I reveal the range of their activity?

source: ཡུལ་བརྗོད་པའམ།
en: How could I elucidate the scope of their knowledge?

source: སྟོབས་བསྔགས་པའམ།
en: How could I praise their strengths?

source: བསམ་པ་བརྟན་པའམ།
en: How could I proclaim their resolute intentions?

source: ཚོགས་ཡོངས་སུ་བརྗོད་པའམ།
en: How could I cast light on their accumulations?

source: སྨོན་ལམ་བཤད་པར་བྱ་བ་འམ།
en: How could I explain their prayers?

source: སྤྱོད་པ་ཡོངས་སུ་བསྟན་པའམ།
en: How could I teach their conduct?

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་མངོན་པར་བརྗོད་པའམ།
en: How could I speak of their pure perfections?

source: ཡང་དག་པར་བསྒྲུབ་པ་ཡོངས་སུ་དག་པའམ། ཡང་དག་པར་བསྟན་པའམ།
en: How could I make clear their pure attainments?

source: ཏིང་ངེ་འཛིན་གྱི་ཁྱད་པར་སྨོས་པའམ།
en: How could I describe the range of their samādhis?

source: ཡེ་ཤེས་སྣང་བ་ཁོང་དུ་ཆུད་པར་ནུས་རེ་སྐན།
en: How could I comprehend the light of their wisdom? “Depart, noble one.

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་རྒྱ་མཚོ་བརྟན་པ་ཞེས་བྱ་བ་ཡོད་དེ། དེ་ན་དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བ་ཞེས་བྱ་བ་འདུག་གིས།
en: In this southern region there is a town called Samudra­pratiṣṭhāna, where dwells an upāsikā by the name of Prabhūtā.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་གྱི་ཚིག་ཐོས་ནས་སྤུ་གཡོས་ཏེ། དགའ་བ་ཆེན་པོའི་ཤུགས་སྐྱེས་ནས། རབ་ཏུ་དགའ་བའི་ཡིད་དང་ལྡན་པར་གྱུར་བ་ངོ་མཚར་གྱི་བསམ་པ།
en: When Sudhana, the head merchant’s son, heard the words of the kalyāṇamitra, the hairs on his body rose, he felt a powerful great happiness, and he had great joy in his mind.

source: རིན་པོ་ཆེ་རབ་ཏུ་དཀོན་པ་ཐོབ་པ།
en: He had obtained this rare, wonderful jewel of motivation.

source: འགྲོ་བ་མང་པོ་ལ་ཕན་པའི་སེམས་དང་བསམ་པས་བྱུང་བ་སངས་རྒྱས་སྐྱེས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པར་འགྲོ་བ་ལ་དབང་བསྒྱུར་བ།
en: He had developed the motivation of intending to benefit many beings. He had the power to encounter the successive appearances of the buddhas.

source: ཆོས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པའི་བློ་གྲོས་ལ་རྟེན་པ།
en: He was dedicated to understanding the pure field of the Dharma.

source: ཐམས་ཅད་དུ་རྗེས་སུ་སོང་པའི་རིག་པ་རྣམ་པར་ཕྱེ་བས་འབྱུང་བ་བསྟན་པ་ལ་བརྩོན་པ།
en: He was dedicated to demonstrating setting forth to liberation in different ways appropriate to all places.

source: དུས་གསུམ་གྱི་དབྱིངས་སུ་མ་འདྲེས་པའི་སངས་རྒྱས་ཀྱི་ཡུལ་དང་ལྡན་པ།
en: He knew the distinct ranges of activity of the buddhas in the levels of the three times.

source: བསོད་ནམས་མི་ཟད་པའི་རྒྱ་མཚོ་ལས་བྱུང་བའི་སེམས་དང་ལྡན་པ།
en: He had a state of mind that had arisen from an inexhaustible ocean of merit.

source: ཡེ་ཤེས་ཀྱི་སྣང་བ་ཆེན་པོ་ལ་དབང་བསྒྱུར་བ།
en: He had the power of the illumination of great wisdom.

source: ཁམས་གསུམ་གྱི་ཁྱིམ་དུ་སྡུད་པའི་སྒོ་ཤིན་ཏུ་གཅོད་པ་དེས།
en: He had broken open the gate that sealed beings within the city of the three realms.

source: ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་གི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ།
en: Sudhana bowed his head to the feet of the boy Indriyeśvara, circumambulated the boy Indriyeśvara many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the boy Indriyeśvara.

source: ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་གི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་གི་སྤྲིན་གྱི་ཆར་ཡོངས་སུ་འཛིན་པ་བྱེད་ཅིང་།
en: Prabhūtā Chapter 16 Sudhana, the head merchant’s son, had obtained the rain from the cloud of the instructions of the kalyāṇamitras.

source: གང་ཆེན་མཚོ་ལྟར་སྤྲིན་ཆེན་པོའི་ཆར་གྱིས་ངོམས་མྱི་ཤེས་པ་དགེ་བའི་བཤེས་གཉེན་གྱི་ཉི་མའི་ཡེ་ཤེས་ཀྱི་འོད་གཟེར་གྱིས་དགེ་བ་ཡོངས་སུ་སྨིན་པར་བྱས་པའི་ས་གཞི་ལས་དབང་པོའི་མྱུ་གུ་འཐོན་ཅིང་སྐྱེས་བ།
en: He was like the ocean that never has too much rain from the clouds. The light from the sun of the wisdom of the kalyāṇamitras had caused the seedling of his powers to sprout from the ground of his ripened good karma.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་ཟླ་བ་ཉ་ཞིང་རྒྱས་པའི་གདམས་ངག་གི་འོད་གཟེར་གྱི་དྲ་བས་ལུས་དང་། སེམས་ཤིན་ཏུ་ཚིམ་པར་བྱས་བ། །
en: The net of light rays from the full moon of the instructions of the kalyāṇamitras had brought ease to his mind and body.

source: དཔྱིད་ཀྱི་ཉི་མའི་འོད་ཀྱིས་གདུངས་པའི་རི་དགས་ཀྱི་ཚོགས་གསལ་ཞིང་བསིལ་བའི་གངས་ཆུ་ལ་འཐུང་བར་འདོད་པ་ལྟར། དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་གི་ཆུ་ལ་འཐུང་བར་འདོད་པ།
en: Like the herds of deer who wish to drink the clear, cooling water from the Himalayas when they are tormented by the heat of the summer sun, he longed to drink the water of the instructions of the kalyāṇamitras.

source: བུང་བ་མང་པོ་འཁོར་ཞིང་ལྡིང་བས་རྒྱས་པར་གྱུར་པའི་པད་མོ་དང་ལྡན་པའི་པདྨོའི་མཚོ་ལྟར་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་གིས་སེམས་ཀྱི་མེ་ཏོག་བུན་ད་རི་ཀ་ཁ་ཕྱེ་བ།
en: The white lotuses of his mind had blossomed through the instructions of the kalyāṇamitras to become a lotus pond like a pond with a bed of blossomed lotuses over which hovers a swarm of bees.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་རྒྱས་པའི་རིན་པོ་ཆེའི་གླིང་ལྟར་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་རིན་པོ་ཆེ་འཕེལ་བའི་སྣང་བས་སེམས་ཤིན་ཏུ་སྣང་བར་བྱས་བ།
en: The jewels of the instructions of the kalyāṇamitras, like the island of jewels that is completely filled with all kinds of jewels, continuously illuminated the mind.

source: འཛམ་བུའི་ཤིང་ཆེན་པོའི་མེ་ཏོག་དང་། འབྲས་བུའི་ཚོགས་ཆེན་པོ་དང་ལྡན་པ་ལྟར་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་སུ་གྱུར་པ། །
en: Like the great accumulation of flowers and fruit on the great Jambu tree, the instructions of the kalyāṇamitras have a perfect accumulation of merit and wisdom.

source: ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པ། ཀླུའི་དབང་པོ་ཆེན་པོ་རྩེད་མོ་དམ་པས་རྩེ་བ་ལས་བྱུང་བའི་ནམ་མཁའི་སྤྲིན་ཆེན་པོ་ལྟར་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ཐོས་པའི་ཚོགས་སུ་གྱུར་པའི་རྣང་ཤིན་ཏུ་ཆེ་བ། །
en: Like the great clouds in the sky born from the sublime play of the great lords of serpents, the accumulation of instructions heard from the kalyāṇamitras expanded.

source: སུམ་ཅུ་རྩ་གསུམ་པའི་འཇིག་རྟེན་གྱི་བརྒྱན་པའི་སྣ་ཚོགས་ཀྱི་སྤོ་ལྟར་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལས་བྱུང་བའི་ཆོས་དྲི་མ་མྱེད་པ་སྣ་ཚོགས་བརྩེགས་པའི་སྤོར་གྱུར་པ།
en: The towering mass of the various stainless Dharmas of the instructions of the kalyāṇamitras was like the variegated summit of the Trāyastriṃśa paradise.
